{
  "subtitle": "", 
  "description": "What is it?", 
  "language": "eng_GB", 
  "title": "Understand Cervical Cancer", 
  "primary_category": "d87c0401003749b184cba394b5145fb2", 
  "created_at": "2015-06-30T21:16:45+00:00", 
  "featured_in_category": true, 
  "modified_at": "2015-11-19T07:43:47.478955+00:00", 
  "_version": {
    "package_version": "1.3.0", 
    "language_version": "2.7.6", 
    "language_version_string": "2.7.6 (default, Mar 22 2014, 23:03:41) \n[GCC 4.8.2]", 
    "language": "python", 
    "package": "elastic-git"
  }, 
  "linked_pages": [], 
  "id": null, 
  "content": "Cancer is a disease that develops when normal body cells change and begin to grow in an abnormal and uncontrolled way. The uncontrolled growth causes a lump/swelling called a tumour in some types of cancer. When cancer starts in the cervix, it is called cervical cancer. The cervix is the lower, narrow end of the uterus. The uterus is where a baby grows when a woman is pregnant. \r\n\r\nThe cervix connects the upper part of the uterus to the vagina (the birth canal). All women are at risk for cervical cancer. It occurs most often in women over the age of 30. The main cause of cervical cancer is the Human Papilloma Virus (HPV).  HPV is a virus that is transmitted from men to women through unprotected sexual intercourse. \r\n\r\nMen can also become infected with HPV but however, they do not develop cervical cancer because they have no cervix. In the early stages, cervical cancer may not cause any signs and symptoms. However advanced cervical cancer may cause bleeding or discharge from the vagina that is not normal for you, such as bleeding after sex. Advanced cervical cancer may also cause pain in the lower abdomen and back as well as foul smelling discharge. \r\n", 
  "source": null, 
  "featured": true, 
  "author_tags": [], 
  "image": null, 
  "published": null, 
  "position": 1, 
  "image_host": "http://thumbor.unicore.io", 
  "slug": "cancer-disease-where-cells-begin-grow-abnormal-way", 
  "uuid": "1475e5a4b5d84682baedb95291e3c9aa"
}