{
  "subtitle": "", 
  "description": "", 
  "language": "eng_GB", 
  "title": "I have used pills for three years.", 
  "primary_category": "b29d5294ddea46a5a8f815b32e21eb7b", 
  "created_at": "2015-06-15T17:05:42+00:00", 
  "featured_in_category": true, 
  "modified_at": "2015-06-17T13:21:37.222229+00:00", 
  "_version": {
    "package_version": "1.2.0", 
    "language_version": "2.7.6", 
    "language_version_string": "2.7.6 (default, Mar 22 2014, 23:03:41) \n[GCC 4.8.2]", 
    "language": "python", 
    "package": "elastic-git"
  }, 
  "linked_pages": [], 
  "id": null, 
  "content": "\r\nDamalie is my name and I am 21 years old. When I was 19, I got pregnant because I did not have enough information on sex. It was such a bad experience since I was young and still in school. I could not manage to carry a pregnancy, I was also still staying with my parents and my boyfriend at the time was a student like me and could not financially support me. My boyfriend and I decided that I should abort. I tried some abortion methods I heard about but the whole process was so painful that I don’t want to remember it or even wish any young person to experience what I went through. I kept on bleeding and my boyfriend took me to a nearby Mariestopes centre. The nurse we found treated me, and the bleeding finally stopped. She treated me so well, and counseled my boyfriend and I. She gave us information on the different Family Planning options that would ensure we do not go through the same situation again. At my age, I did not think it was okay to use family planning, I only thought it was for married people who already had children.I also thought it makes people barren and  would burn my eggs! I thought of many things! And I kept asking myself, how will my friends see me using family planning? But the nurse was patient and counseled us saying family planning was good for everyone. Since my boyfriend and I were not going to abstain, we decided to use pills. I have used pills since then, I find no problem taking them, I always take them on time because it became part of me to follow my routine. I was able to finish my A level, and am now in my second year at campus . My boyfriend has just graduated too and we are planning to start a family when I finish school.\r\n\r\n**The facts:**\r\n\r\nPills are tablets that contain one or two hormones and are taken by mouth to prevent unwanted pregnancy. The woman takes one pill a round the same time everyday and the pill stops the release of eggs from the women’s body, so she cannot become pregnant. Pills do not interfere with sex and can protect against certain cancers (cancer of the lining of the uterus, cancer of the ovary) and diseases (pelvic inflammatory disease).Pills help women have regular periods, reduced cramps during periods and improved skin. They need to be taken around the same time every day in order to be effective. Pills may cause minor side effects, like changes in bleeding patterns, headaches, dizzness, nausea, breast tenderness, weight change, or mood changes. OIlls have no effect on babies born to women who use them.Pills are perfectly safe to take continuously for many years. They also do not collect in the stomach. The pill dissolves each day.\r\n\r\n**What to do:**\r\n\r\nFor more information on PIlls please call a toll free line 0800120333 or visit the nearest Mariestopes centre.", 
  "source": null, 
  "featured": true, 
  "author_tags": [], 
  "image": null, 
  "published": null, 
  "position": 3, 
  "image_host": "http://qa.thumbor.unicore.io", 
  "slug": "i-have-used-pills-three-years", 
  "uuid": "177bb24c86054daba0d53eb14b3308ab"
}