{
  "subtitle": "", 
  "description": "Right Decision", 
  "language": "eng_GB", 
  "title": "Damalie's decision", 
  "primary_category": "b29d5294ddea46a5a8f815b32e21eb7b", 
  "created_at": "2015-06-15T17:05:42+00:00", 
  "featured_in_category": true, 
  "modified_at": "2015-10-27T07:02:13.716702+00:00", 
  "_version": {
    "package_version": "1.2.0", 
    "language_version": "2.7.6", 
    "language_version_string": "2.7.6 (default, Mar 22 2014, 23:03:41) \n[GCC 4.8.2]", 
    "language": "python", 
    "package": "elastic-git"
  }, 
  "linked_pages": [], 
  "id": null, 
  "content": "Damalie is my name and I am 21 years old. When I was 19, I got pregnant because I did not have enough information on sex. It was such a bad experience since I was young and still in school. I could not manage to carry a pregnancy, I was also still staying with my parents and my boyfriend at the time was a student like me and could not financially support me. My boyfriend and I decided that I should abort. I tried some abortion methods I heard about but the whole process was so painful that I don’t want to remember it or even wish any young person to experience what I went through. I kept on bleeding and my boyfriend took me to a nearby Mariestopes centre. \r\n\r\nThe nurse treated me, and the bleeding finally stopped. She treated me so well, and counselled my boyfriend and I. She gave us information on the different Family Planning options that would ensure we do not go through the same situation again. At my age, I did not think it was okay to use family planning, I only thought it was for married people who already had children.I also thought it makes people barren and would burn my eggs! I thought of many things! And I kept asking myself, how will my friends see me using family planning? But the nurse was patient and counselled us saying family planning was good for everyone.\r\n\r\nSince my boyfriend and I were not going to abstain, we decided to use pills. I have used pills since then, I find no problem taking them, I always take them on time because it became part of me to follow my routine. I was able to finish my A level, and am now in my second year at campus . My boyfriend has just graduated too and we are planning to start a family when I finish school.\r\n\r\n[Be Safe][1]\r\n\r\n[Take Action][2]\r\n\r\n\r\n  [1]: http://iogt.qa-hub.unicore.io/page/585ab446df5b4c5981a9d09df5e1c13a/\r\n  [2]: http://iogt.qa-hub.unicore.io/page/c29fe0b3db2d4adea77bd84531d819ad/", 
  "source": null, 
  "featured": true, 
  "author_tags": [], 
  "image": null, 
  "published": null, 
  "position": 12, 
  "image_host": "http://thumbor.unicore.io", 
  "slug": "i-have-used-pills-three-years", 
  "uuid": "177bb24c86054daba0d53eb14b3308ab"
}