{
  "subtitle": "", 
  "description": "Is there hope?", 
  "language": "eng_GB", 
  "title": "Jane faces cervical cancer", 
  "primary_category": "b29d5294ddea46a5a8f815b32e21eb7b", 
  "created_at": "2015-06-15T17:08:30+00:00", 
  "featured_in_category": false, 
  "modified_at": "2015-11-19T09:09:27.483681+00:00", 
  "_version": {
    "package_version": "1.2.0", 
    "language_version": "2.7.6", 
    "language_version_string": "2.7.6 (default, Mar 22 2014, 23:03:41) \n[GCC 4.8.2]", 
    "language": "python", 
    "package": "elastic-git"
  }, 
  "linked_pages": [
    "1475e5a4b5d84682baedb95291e3c9aa", 
    "3a00da349b824379abeb924b74f5693b"
  ], 
  "id": null, 
  "content": "My name is Jane. I’m aged 26 years and I live in one of the big towns in Uganda. In the recent past months I was in an intimate relationship intending to get married to a man I loved. However my hopes were shuttered when my boyfriend told me he was considering quitting the relationship because I could bleed whenever we played sex and I had a smelly virginal discharge. When I got bleeding during our first sexual encounter, I was so terrified that I couldn’t sleep at night. I decided to consult my sister in law who advised me to visit the nearest Health Center for checkup suspecting an infection because of the smelly virginal discharge. \r\n\r\nAfter undergoing several tests together with my boyfriend, I was not found with anything. This confused both of us. He slowly by slowly started withdrawing from the relationship, he stopped calling me often like before and could no longer initiate sex. Two months later, he ceased all communication after he had confronted me saying I was cursed and that is why I had the smelly virginal discharge and could bleed during sex. I was so embarrassed but it gave me more courage to go to another health centre. There I was advised to go for cervical cancer screening something that was new to my ears. It sounded like a terrible disease and I was worried because my friend had told me that cancer is a death sentence. \r\n\r\nI agreed to be screened and I was diagnosed with cervical cancer but the health workers gave me hope that it would cure if I got treatment. They went ahead and gave me cryo-therapy treatment and I could no longer bleed during sex because the cancerous liaisons had been treated. I was healed because I went early for check up and got the treatment. I encourage all females above twenty four years to go and seek cervical cancer screening services on time. Don’t keep silent!\r\n\r\n", 
  "source": null, 
  "featured": false, 
  "author_tags": [], 
  "image": null, 
  "published": null, 
  "position": 11, 
  "image_host": "http://thumbor.unicore.io", 
  "slug": "cervical-cancer-curable", 
  "uuid": "2ae22b90475e48c69b19fb2c4ceb0cd7"
}